app/Controllers/Admin.php

    public function index()
    {
        // Ambil data dari modul
        $data['judul'] = 'Dashboard';

        // Ambil data user dari session (CI4 way)
        $data['user'] = $this->ModelUser->cekData(['email' => session()->get('email')]);

        // Ambil data anggota (menggunakan ModelUser CI4 yang sudah kita buat)
        $data['anggota'] = $this->ModelUser->getUserLimit();

        // Ambil data buku (menggunakan ModelBuku CI4)
        $data['buku'] = $this->ModelBuku->getBuku()->getResultArray();

        // !! LOGIKA TAMBAHAN UNTUK KOTAK DASHBOARD (hlm 66-68) !!
        // Kita panggil model di controller, bukan di view

        // 1. Jumlah Anggota (Admin)
        // Adaptasi: $this->ModelUser->getUserWhere (['role_id' => 1])->num_rows();
        // Kita gunakan countAllResults() di CI4
        $data['total_anggota'] = $this->ModelUser->where(['role_id' => 1])->countAllResults();

        // 2. Stok Buku Terdaftar
        // Adaptasi: $this->ModelBuku->total('stok', $where);
        // Kita gunakan selectSum() di CI4
        $data['total_stok_buku'] = $this->ModelBuku->selectSum('stok')->where(['stok !=' => 0])->get()->getRowArray()['stok'];

        // 3. Buku yang dipinjam
        // Adaptasi: $this->ModelBuku->total('dipinjam', $where);
        $data['total_dipinjam'] = $this->ModelBuku->selectSum('dipinjam')->where(['dipinjam !=' => 0])->get()->getRowArray()['dipinjam'];

        // 4. Buku yang dibooking
        // Adaptasi: $this->ModelBuku->total('dibooking', $where);
        $data['total_dibooking'] = $this->ModelBuku->selectSum('dibooking')->where(['dibooking !=' => 0])->get()->getRowArray()['dibooking'];
---
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role_id` = 1
SELECT SUM(`stok`) AS `stok`
FROM `buku`
WHERE `stok` != 0
SELECT SUM(`dipinjam`) AS `dipinjam`
FROM `buku`
WHERE `dipinjam` != 0
SELECT SUM(`dibooking`) AS `dibooking`
FROM `buku`
WHERE `dibooking` != 0