app/Controllers/Laporan.php

    public function laporan_anggota()
    {
        $data['judul'] = 'Laporan Data Anggota';
        $data['user'] = $this->ModelUser->cekData(['email' => session()->get('email')]);
        $data['anggota'] = $this->ModelUser->where('role_id !=', 1)->findAll();
---
SELECT *
FROM `user`
WHERE `role_id` != 1