app/Controllers/Pinjam.php

    public function index()
    {
        $data['judul'] = "Data Peminjaman";
        $data['user'] = $this->ModelUser->cekData(['email' => session()->get('email')]);

        // Ambil data join pinjam dan user
        $data['pinjam'] = $this->ModelPinjam->joinData()->getResultArray();
---
SELECT *
FROM `pinjam` `p`
JOIN `booking` `b` ON `b`.`id_booking` = `p`.`id_booking`
JOIN `user` `u` ON `u`.`id` = `p`.`id_user`