app/Models/ModelBuku.php

SELECT *
FROM `buku`
---
    public function getBuku($id = null)
    {
        if ($id === null) {
            return $this->findAll();
        }
        return $this->getWhere(['id' => $id]);

UPDATE `buku` SET `dipinjam` = 'dipinjam-1', `stok` = 'stok+1'
WHERE `id` = '2'
---
    public function updateBuku($data = null, $where = null)
    {
        $this->update($where, $data);

SELECT *
FROM `kategori`
---
    public function getKategori()
    {
        return $this->db->table('kategori')->get()->getResultArray();

SELECT *
FROM `kategori`
---
    public function joinKategoriBuku($where)
    {
        $builder = $this->db->table('buku');
        $builder->select('buku.id_kategori,kategori.kategori');
        $builder->from('buku');
        $builder->join('kategori', 'kategori.id = buku.id_kategori');
        $builder->where($where);
        return $builder->get();