app/Models/ModelUser.php

SELECT *
FROM `user`
 LIMIT 10
---
    public function getUserLimit()
    {
        // Ini setara dengan $this->db->select('*'); $this->db->from('user');
        // $this->db->limit(10, 0); return $this->db->get();
        return $this->limit(10, 0)->get()->getResultArray();