app/Models/ModelPinjam.php

    public function updateData($table, $data, $where)
    {
        $this->db->table($table)->where($where)->update($data);
---
UPDATE `pinjam` SET `tgl_pengembalian` = '2025-11-18', `status` = 'Kembali', `total_denda` = 0
WHERE `no_pinjam` = 'PJ20251118004'

    public function joinData()
    {
        $builder = $this->db->table('pinjam p');
        $builder->select('p.*, u.nama, u.email');
        $builder->join('user u', 'u.id = p.id_user');
        return $builder->get();
---
SELECT `p`.*, `u`.`nama`, `u`.`email`
FROM `pinjam` `p`
JOIN `user` `u` ON `u`.`id` = `p`.`id_user`